// 5. Напишите программу, которая выводит на экран «5,4,3,2,1» используя цикл for.

package INTECH;

public class Cycles_1_5_NumbersDecreasing {
        public static void main(String [] args) {
            System.out.print(5);
            for (int i = 4; i>= 1; i--)
        System.out.print(", " + i);
        }
}